<?php
echo "1.要件定義(要求仕様書)"."<br>";
echo "要件定義とはシステム開発における工程のひとつでありお客さまの「こんなものが欲しいんだよね～」をまとめる工程のこと**です。"."<br>";
echo "2.単体テスト・結合テスト"."<br>";
echo "単体テスト (UT)とはシステム開発における工程のひとつであり「合体前の部品は、それぞれちゃんと動く？」を確認するテストのこと　結合テスト (IT)とはシステム開発における工程のひとつであり「合体して、ちゃんと動く？」を確認するテストのこと"."<br>";
echo "3.テスト仕様書(どのようなもの、項目)"."<br>";
echo "テスト仕様書とは、システムやソフトウェアが、クライアントのヒアリングをもとに作り上げた要件定義書の通りに機能するかどうか、テストするポイントをまとめたドキュメントです。
テストを実施した環境
実施するテストの内容
テストを実施するためのシステムの操作手順
テストの実行結果
個々のテスト項目を識別するための番号や記号（通し番号など）
テストを実施した年月日
テストを実行した担当者"."<br>";
?>